I try to run this terraform code:
```
terraform {
  required_providers {
    openvpn-cloud = {
      source  = "OpenVPN/openvpn-cloud"
      version = "0.0.7"
    }
  }
}

provider "openvpn-cloud" {
  base_url = "https://mycompany.api.openvpn.com"
}

resource "openvpncloud_network" "vpn_network" {
  name = "test_network"
  default_connector {
    name          = "test_connector"
    vpn_region_id = "fi-hel"
  }
  default_route {
    value = "10.1.1.0/24"
    type  = "IP_V4"
  }
  provider = openvpn-cloud
}
```

And as I see my resource has been created:
```
> terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # openvpncloud_network.vpn_network will be created
  + resource "openvpncloud_network" "vpn_network" {
      + description     = "Managed by Terraform"
      + egress          = true
      + id              = (known after apply)
      + internet_access = "LOCAL"
      + name            = "test_network"
      + system_subnets  = (known after apply)

      + default_connector {
          + id                = (known after apply)
          + ip_v4_address     = (known after apply)
          + ip_v6_address     = (known after apply)
          + name              = "test_connector"
          + network_item_id   = (known after apply)
          + network_item_type = (known after apply)
          + vpn_region_id     = "fi-hel"
        }

      + default_route {
          + id    = (known after apply)
          + type  = "IP_V4"
          + value = "10.1.1.0/24"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

openvpncloud_network.vpn_network: Creating...
openvpncloud_network.vpn_network: Creation complete after 1s [id=c17a238a-cbda-4fbc-a1a1-0a2e6b5009cd]
╷
│ Warning: The default connector for this network needs to be set up manually
│ 
│   with openvpncloud_network.vpn_network,
│   on main.tf line 16, in resource "openvpncloud_network" "vpn_network":
│   16: resource "openvpncloud_network" "vpn_network" {
│ 
│ Terraform only creates the OpenVPN Cloud default connector object for this network, but additional manual steps are required to associate a host in
│ your infrastructure with this connector. Go to https://openvpn.net/cloud-docs/connector/ for more information.
╵

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
<img width="1225" alt="Screenshot 2022-12-26 at 15 05 45" src="https://user-images.githubusercontent.com/579213/209542022-61bc75ee-2cb5-4123-bfab-379622bd02b3.png">